In [3]:
import numpy as np
import pandas as pd
import re

In [4]:
data = pd.read_csv('fatal-police-shootings-data.csv')

In [5]:
df = pd.DataFrame(data)

In [6]:
df.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,2015-01-02,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,2015-01-04,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,2015-01-04,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False

In [7]:
df['deaths'] = 1

In [8]:
df.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,deaths
0,3,Tim Elliot,2015-01-02,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False,1
1,4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False,1
2,5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False,1
3,8,Matthew Hoffman,2015-01-04,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False,1
4,9,Michael Rodriguez,2015-01-04,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False,1

In [9]:
dx = df.pivot_table(values='deaths', index='race', columns='signs_of_mental_illness', aggfunc=np.sum)

In [10]:
dx

signs_of_mental_illness  False  True
race
A                           69    24
B                         1114   184
H                          745   157
N                           64    14
O                           37    11
W                         1763   713

### Za pomocą Map, Applymap lub Apply dodaj do tego zestawienia kolumnę wskazującą jaki odsetek ofiar interwencji wykazywało oznaki choroby psychicznej dla każdej z ras. Odpowiedz, która z nich charakteryzuje się największym odsetkiem znamion choroby psychicznej podczas interwencji.

In [11]:
df_race = df.groupby('race').agg({'signs_of_mental_illness': 'mean', 'deaths': 'count'})

In [12]:
dz = df_race.apply(lambda row: round(row, 2), axis= 0)
dz

      signs_of_mental_illness  deaths
race
A                        0.26      93
B                        0.14    1298
H                        0.17     902
N                        0.18      78
O                        0.23      48
W                        0.29    2476

In [13]:
dz[dz['signs_of_mental_illness'] == max(dz['signs_of_mental_illness'])]

      signs_of_mental_illness  deaths
race
W                        0.29    2476

### Dodaj kolumnę oznaczającą dzień tygodnia, w którym doszło do interwencji. Zlicz interwencje według odpowiedniego dnia tygodnia. Następnie stwórz wykres kolumnowy, tak aby dni tygodnia były uszeregowane od poniedziałku do niedzieli.

In [14]:
df['date'] = pd.to_datetime(df['date'])

In [15]:
df['day_of_the_week'] = df['date'].dt.day_name()

In [16]:
df.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,deaths,day_of_the_week
0,3,Tim Elliot,2015-01-02,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False,1,Friday
1,4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False,1,Friday
2,5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False,1,Saturday
3,8,Matthew Hoffman,2015-01-04,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False,1,Sunday
4,9,Michael Rodriguez,2015-01-04,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False,1,Sunday

In [17]:
dy = df.pivot_table(values='deaths', index='race', columns='day_of_the_week', aggfunc=np.sum)

In [18]:
dy

day_of_the_week,Friday,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
race,,,,,,,
A,17,13,16,11,8,13,15
B,168,172,173,166,214,174,231
H,123,123,110,136,157,136,117
N,8,9,11,15,11,10,14
O,10,5,4,6,6,8,9
W,348,349,334,341,338,394,372

In [19]:
column_order = ['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']

In [20]:
dy = dy[column_order]

In [21]:
dy

day_of_the_week,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
race,,,,,,,
A,13,13,15,8,17,16,11
B,172,174,231,214,168,173,166
H,123,136,117,157,123,110,136
N,9,10,14,11,8,11,15
O,5,8,9,6,10,4,6
W,349,394,372,338,348,334,341

In [22]:
dy.loc['Total'] = dy.sum(numeric_only=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_19600\696919233.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dy.loc['Total'] = dy.sum(numeric_only=True)

In [23]:
dy

day_of_the_week,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
race,,,,,,,
A,13,13,15,8,17,16,11
B,172,174,231,214,168,173,166
H,123,136,117,157,123,110,136
N,9,10,14,11,8,11,15
O,5,8,9,6,10,4,6
W,349,394,372,338,348,334,341
Total,671,735,758,734,674,648,675

### Wczytaj do projektu dane dotyczące populacji w poszczególnych stanach USA oraz dane dotyczące skrótów poszczególnych stanów. Połącz te bazy danych w taki sposób, aby móc policzyć do ilu incydentów w bazie dotyczącej śmiertelnych interwencji doszło w przeliczeniu na 1000 mieszkańców każdego ze stanów.

In [24]:
data_1 = pd.read_html('https://en.wikipedia.org/wiki/List_of_U.S._state_and_territory_abbreviations', attrs={"class": "wikitable sortable"})

In [25]:
table_1 = pd.DataFrame(data_1[0]).transpose()

In [26]:
table_1.reset_index(drop = True, inplace = True)

In [27]:
table_1 = table_1.transpose()

In [28]:
table_1.head()

,0,1,2,3,4,5,6,7,8,9
0,Codes:,Codes:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ISO,"ISO 3166 codes (2-letter, 3-letter, and 3-digi...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ANSI,2-letter and 2-digit codes from the ANSI stand...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,USPS,2-letter codes used by the United States Posta...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,USCG,2-letter codes used by the United States Coast...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
table_1 = table_1[table_1[1] == 'State']

In [30]:
table_1 = table_1.drop(columns=[1, 2, 4, 5, 6, 7, 8, 9])
table_1.rename(columns={0: 'State', 3: 'state'}, inplace = True)
table_1.head()

         State state
11     Alabama    AL
12      Alaska    AK
13     Arizona    AZ
14    Arkansas    AR
15  California    CA

In [31]:
data_2 = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states_by_population', attrs={"class": "wikitable sortable"})

In [32]:
table_2 = pd.DataFrame(data_2[0])

In [33]:
table_2.head()

,"Rank in states & territories, 2019","Rank in states & territories, 2010",State,"Population estimate, July 1, 2019[2]","Census population, April 1, 2010[3]","Percent change, 2010–2019[note 1]","Absolute change, 2010-2019","Total seats in the U.S. House of Representatives, 2013–2023","Estimated population per electoral vote, 2019[note 2]","Estimated population per House seat, 2019","Census population per House seat, 2010","Percent of the total U.S. population, 2018[note 3]"
0,1.0,1.0,California,39512223,37254523,6.1%,+2257700,53,718404,745514,702885,11.96%
1,2.0,2.0,Texas,28995881,25145561,15.3%,+3850320,36,763050,805441,698503,8.68%
2,3.0,3.0,New York,21477737,18801310,14.2%,+2676427,27,740611,795472,696468,6.44%
3,4.0,4.0,Florida,19453561,19378102,0.4%,+75459,27,670812,720502,717707,5.91%
4,5.0,5.0,Illinois,12801989,12702379,0.8%,+99610,18,640099,711222,705715,3.87%

In [34]:
table_3 = pd.DataFrame(pd.read_csv('fatal-police-shootings-data.csv'))
table_3['deaths'] = 1
table_3.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera,deaths
0,3,Tim Elliot,2015-01-02,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False,1
1,4,Lewis Lee Lembke,2015-01-02,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False,1
2,5,John Paul Quintero,2015-01-03,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False,1
3,8,Matthew Hoffman,2015-01-04,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False,1
4,9,Michael Rodriguez,2015-01-04,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False,1

In [35]:
t_1 = table_3.drop(columns={'id', 'name', 'date', 'manner_of_death','city', 'armed', 'age', 'gender', 'race', 'signs_of_mental_illness', 'threat_level', 'flee', 'body_camera'})

In [36]:
t_1.head()

  state  deaths
0    WA       1
1    OR       1
2    KS       1
3    CA       1
4    CO       1

In [37]:
t_f = t_1.join(table_1.set_index('state'), on='state')

In [38]:
t_f = t_f.groupby(by='State', as_index=False).sum()
t_f.head()

        State  deaths
0     Alabama     104
1      Alaska      39
2     Arizona     254
3    Arkansas      83
4  California     799

In [46]:
t_ff = t_f.join(table_2.set_index('State'), on='State')
t_x = t_ff.drop(columns={'Rank in states & territories, 2019', 'Rank in states & territories, 2010', 'Census population, April 1, 2010[3]', 'Percent change, 2010–2019[note 1]', 'Absolute change, 2010-2019', 'Total seats in the U.S. House of Representatives, 2013–2023', 'Estimated population per electoral vote, 2019[note 2]', 'Estimated population per House seat, 2019', 'Census population per House seat, 2010'})
t_x = t_x.rename(columns={'Population estimate, July 1, 2019[2]': 'Population estimate 2019'})
t_x.head()

,State,deaths,Population estimate 2019,"Percent of the total U.S. population, 2018[note 3]"
0,Alabama,104,4903185,1.48%
1,Alaska,39,731545,0.22%
2,Arizona,254,7278717,2.17%
3,Arkansas,83,3017825,0.91%
4,California,799,39512223,11.96%

In [50]:
def per_1000(row):
    per = row['deaths']/row['Population estimate 2019']*1000
    return round(per, 2)

In [51]:
t_x['Deaths per 1000 people'] = t_x.apply(lambda row: per_1000(row), axis=1)

In [53]:
t_x.head()

,State,deaths,Population estimate 2019,"Percent of the total U.S. population, 2018[note 3]",Deaths per 1000 people
0,Alabama,104,4903185,1.48%,0.02
1,Alaska,39,731545,0.22%,0.05
2,Arizona,254,7278717,2.17%,0.03
3,Arkansas,83,3017825,0.91%,0.03
4,California,799,39512223,11.96%,0.02